controllers/ReserveBidController.php

    public function actionCreate()
    {
        $request = Yii::$app->request;
        $model = new ReserveBid();

        if($request->isAjax){
            /*
            *   Process for ajax request
            */
            Yii::$app->response->format = Response::FORMAT_JSON;
            if($request->isGet){
                return [
                    'title'=> "Добавить резервную заявку",
                    'content'=>$this->renderAjax('create', [
                        'model' => $model,
                    ]),
                    'footer'=> Html::button('Закрыть',['class'=>'btn btn-default pull-left','data-dismiss'=>"modal"]).
                                Html::button('Добавить',['class'=>'btn btn-primary','type'=>"submit"])

                ];
            }else if($model->load($request->post()) && $model->save()){
---
INSERT INTO `reserve_bid` (`client_id`, `technic_type_id`, `technic_type_subgroup_id`, `technic_id`, `driver_id`, `date`, `time`, `hours`, `price`, `mkad`, `mkad_price`, `total`, `pay_form`, `route`, `comment`) VALUES (4, 2, 26, 24, 1, '2021-10-21', '10:48', '10', '0202', '0203', '0230', '2323', 'Б/Н Расчет + НДС', '', '')