controllers/TechnicController.php

    public function actionCreate()
    {
        $request = Yii::$app->request;
        $model = new Technic();

        if($request->isAjax){
            /*
            *   Process for ajax request
            */
            Yii::$app->response->format = Response::FORMAT_JSON;
            if($request->isGet){
                return [
                    'title'=> "Добавить технику",
                    'content'=>$this->renderAjax('create', [
                        'model' => $model,
                    ]),
                    'footer'=> Html::button('Закрыть',['class'=>'btn btn-default pull-left','data-dismiss'=>"modal"]).
                                Html::button('Добавить',['class'=>'btn btn-primary','type'=>"submit"])

                ];
            }else if($model->load($request->post()) && $model->save()){
---
INSERT INTO `technic` (`name`, `model`, `gos_num`, `characteristics`, `equipment`, `type_id`, `subgroup_id`) VALUES ('024', '', '', '', '', 1, 1)