controllers/TechnicController.php

UPDATE `technic` SET `reserve`=0, `reserved_by`=NULL
---
    public function actionClear($containerPjaxReload = '#crud-datatable-pjax')
    {
        $request = Yii::$app->request;
        $models = Technic::updateAll(['reserve' => false,'reserved_by' => null]);