models/MultiTechSubgroupQuery.php

SELECT * FROM `multi_tech_subgroup` WHERE `subgroup_id`='30'
---
    public function all($db = null)
    {
        return parent::all($db);