models/TechnicTypeSubgroupQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `technic_type_subgroup` WHERE `technic_type_id`='1'