models/TechnicTypeQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `technic_type`