models/TechnicQuery.php

SELECT * FROM `technic`
---
    public function all($db = null)
    {
        return parent::all($db);