models/WorkTypeQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `work_type`