models/WorkKindQuery.php

SELECT * FROM `work_kind`
---
    public function all($db = null)
    {
        return parent::all($db);